INSERT INTO Client (client_id, surname, first_name,	patronymic, passport_series_number, birth_date,	driver_license_number,	CTP_policy_registration_date) VALUES
(1, 'Соколов', 'Антон', 'Тимофеевич', '5717597606', '1970-01-04', '14765', '2023-05-13')
(2, 'Злобин', 'Владимир', 'Михайлович', '5717339415', '1970-05-16', '12278', '2023-05-13')
(3, 'Власова', 'Валентина', NUll, '5717249521', '1971-02-04', NULL, '2023-05-13')
(4, 'Павлова', 'Вероника', 'Ильинична', NUll, '1971-03-03', '11062', '2023-05-13')
(5, 'Федоров', 'Никита', 'Павлович', '5717800131', '1972-04-04', '11205', '2023-06-13')
(6, 'Щербаков', 'Иван', NULL, '5717082602', '1972-05-04', '11414', '2023-05-13')
(7, 'Балашова', 'Агата', 'Семёновна', '5717115456', '1980-06-04', '11068', '2023-05-13')
(8, 'Басов', 'Матвей', 'Маркович', '5717314995', '1960-07-11', '12324', '2023-05-13')
(9, 'Бабушкина', 'Виктория', 'Вячеславовна', '5717642199', '1990-08-04', '17308', '2023-05-13')
(10, 'Яковлев', 'Илья', 'Егорович', '5717197624', '1999-01-04', '13028', '2023-01-13')
(11, 'Захарова', 'Виктория', 'Михайловна', '5717631714', '2003-01-04', NULL, NULL)
(12, 'Носова', 'Мирослава', 'Демидовна', '5717235888', '1978-01-01', '12817', '2023-05-13')
(13, 'Новиков', 'Арсений', 'Ярославович', '5717587623', '1995-01-02', '14895', '2023-05-13')
(14, 'Муравьев', 'Николай', 'Марсельевич', '5717251261', '1996-01-03', '13825', '2023-05-13')
(15, 'Давыдов', 'Марк', 'Александрович', '5717263220', '1951-01-12', '11245', '2023-04-13')
(16, 'Михайлова', 'Анастасия', 'Сергеевна', '5717066522', '1979-01-04', '10768', '2023-05-13')
(17, 'Семенова', 'Елизавета', 'Дмитриевна', NULL, '1993-05-04', '16342', '2023-05-13')
(18, 'Жукова', 'Виктория', 'Данииловна', '5717830859', '2000-01-04', '19592', NULL)
(19, 'Орлов', 'Дмитрий', 'Даниилович', '5717426024', '2008-01-05', '17402', '2023-05-13')
(20, 'Кочетков', 'Владимир', 'Фёдорович', '5717585675', '2004-01-06', '18643', '2023-05-13')
(21, 'Семенова', 'Анна', 'Кирилловна', '5717036702', '2001-03-06', '16503', '2023-05-13')
(22, 'Волков', 'Михаил', 'Даниилович', '5717097432', '2001-01-07', '16853', NULL)
(23, 'Соколова', 'Элина', 'Владимировна', '5717516063', '1977-01-10', '14466', '2023-05-13')
(24, 'Третьякова', 'Александра', 'Владиславовна', '5717557923', '1974-01-04', '16025', '2023-05-13')
(25, 'Мартынов', 'Андрей', 'Ильич', '5717326686', '1997-10-04', '10813', '2023-05-13')
(26, 'Герасимова', 'Ника', 'Павловна', '5717295944', '1989-11-04', '2023-05-13', '2023-06-13')
(27, 'Виноградов', 'Ярослав', 'Александрович', '5717881895', '1939-01-04', '18089', '2023-05-13')
(28, 'Белова', 'Мария', 'Алексеевна', '5717170348', '1999-11-09', NUll, '2023-05-13')
(29, 'Соколов', 'Иван', 'Александрович', NULL, '1992-09-04', '10363', '2023-05-13')
(30, 'Исакова', 'Асия', NULL, '5717002426', '1965-06-04', '13601', '2023-07-13')

INSERT INTO Car(car_id, state_number, rating, category, child_safety_seat, status_rent) VALUES
(1, 'аа001а59', '7', 'Эконом', 'Есть', 'Арендована')
(2, 'аа002а59', '10', 'Бизнес', 'Нет', 'Свободена')
(3, 'аа003а59', '2', 'Комфорт', 'Есть', 'Свободена')
(4, 'аа004а59', '4', 'Бизнес', 'Есть', 'Свободена')
(5, 'аа005а59', '5', 'Эконом', 'Есть', 'Арендована')
(6, 'аа006а59', '7', 'Комфорт', 'Есть', 'Арендована')
(7, 'аа007а59', '6', 'Эконом', 'Нет', 'Свободена')
(8, 'аа008а59', '7', 'Комфорт', 'Есть', 'Свободена')
(9, 'аа009а59', '2', 'Эконом', 'Есть', 'Свободена')
(10, 'аа011а59', '1', 'Эконом', 'Нет', 'Свободена')
(11, 'аа012а59', '1', 'Бизнес', 'Есть', 'Свободена')
(12, 'аа113а59', '3', 'Комфорт', 'Нет', 'Арендована')
(13, 'аа114а59', '4', 'Эконом', 'Нет', 'Арендована')
(14, 'аа115а59', '5', 'Комфорт', 'Нет', 'Свободена')
(15, 'аа116а59', '5', 'Эконом', 'Есть', 'Арендована')
(16, 'аа117а59', '5', 'Бизнес', 'Есть', 'Свободена')
(17, 'аа118а59', '6', 'Эконом', 'Нет', 'Свободена')
(18, 'аа119а59', '8', 'Эконом', 'Нет', 'Арендована')
(19, 'аа121а59', '7', 'Эконом', 'Есть', 'Свободена')
(20, 'аа122а59', '7', 'Бизнес', 'Нет', 'Арендована')
(21, 'аа123а59', '7', 'Комфорт', 'Нет', 'Свободена')
(22, 'аа134а59', '5', 'Эконом', 'Есть', 'Свободена')
(23, 'аа124а59', '5', 'Комфорт', 'Есть', 'Арендована')
(23, 'аа125а59', '3', 'Эконом', 'Нет', 'Арендована')
(24, 'аа126а59', '10', 'Эконом', 'Нет', 'Арендована')
(25, 'аа127а59', '9', 'Бизнес', 'Есть', 'Свободена')
(26, 'аа128а59', '9', 'Эконом', 'Есть', 'Свободена')
(27, 'аа129а59', '2', 'Комфорт', 'Нет', 'Арендована')
(28, 'аа133а59', '6', 'Бизнес', 'Нет', 'Свободена')
(29, 'аа139а59', '7', 'Эконом', 'Есть', 'Свободена')
(30, 'аа155а59', '7', 'Бизнес', 'Нет', 'Арендована')

INSERT INTO Car_history (car_history_id, car_id, start_use_date, end_use_date) VALUES
(1, 7, '2024-03-09', NUll)
(2, 5, '2023-08-23', '2023-08-29')
(3, 7, '2023-04-23', '2023-04-24')
(4, 2, '2023-12-25', '2023-12-27')
(5, 7, '2024-02-06', '2024-02-06')
(6, 2, '2024-01-07', '2024-01-07')
(7, 7, '2023-05-13', '2023-05-16')
(8, 7, '2022-04-03', '2022-04-06')
(9, 2, '2022-05-03', '2022-05-06')
(10, 2, '2021-04-03', '2021-04-06')
(11, 2, '2022-02-03', '2022-03-06')
(12, 2, '2022-01-03', '2022-01-06')
(13, 7, '2022-07-03', '2022-07-06')
(14, 7, '2020-08-03', '2020-08-06')
(15, 2, '2019-05-03', '2019-05-06')
(16, 2, '2022-04-03', '2022-04-06')
(17, 2, '2022-04-03', '2022-04-06')
(18, 3, '2023-07-03', '2023-07-06')
(19, 5, '2024-04-03', NUll)
(20, 3, '2022-04-03', '2022-04-06')
(21, 3, '2024-04-03', NUll)
(22, 5, '2022-04-03', '2022-04-06')
(23, 3, '2018-04-03', '2018-04-06')
(24, 3, '2022-04-03', '2022-04-06')
(25, 5, '2021-03-03', '2021-03-06')
(26, 5, '2022-11-03', '2022-11-06')
(27, 3, '2017-04-03', '2017-04-06')
(28, 3, '2022-12-03', '2022-12-06')
(29, 7, '2022-04-03', '2022-04-06')
(30, 7, '2020-10-03', '2020-10-06')


INSERT INTO Rate (rate_id, car_id, cost) VALUES
(1, 1, 140)
(2, 2, 470)
(3, 3, 720)
(3, 4, 960)
(3, 5, 230)
(4, 6, 410)
(5, 7, 350)
(6, 8, 680)
(6, 9, 550)
(6, 10, 930)
(7, 11, 1100)
(8, 12, 2100)
(9, 13, 150)
(9, 14, 100)
(10, 15, 430)
(11, 16, 720)
(11, 17, 600)
(11, 18, 180)
(12, 19, 800)
(13, 20, 20)
(13, 21, 20)
(14, 22, 20)
(14, 23, 20)
(15, 24, 20)
(15, 25, 20)
(16, 26, 20)
(17, 27, 20)
(18, 28, 20)
(19, 29, 20)
(19, 30, 20)


INSERT INTO Review (review_id, car_id, client_id, score, review_type) VALUES
(1, 4, 8, 2,'Отрицательный')
(2, 5, 8, 2,'Отрицательный')
(3, 7, 5, 7,'Положительный')
(4, 10, 7, 2,'Отрицательный')
(5, 4, 9, 8,'Положительный')
(6, 9, 8, 2,'Отрицательный')
(7, 4, 10, 9,'Положительный')
(8, 3, 8, 9,'Положительный')
(9, 21, 28, 2,'Отрицательный')
(10, 22, 21, 6,'Положительный')
(11, 29, 8, 2,'Отрицательный')
(12, 30, 29, 6,'Положительный')
(13, 17, 17, 7,'Положительный')
(14, 13, 16, 2,'Отрицательный')
(15, 14, 11, 2,'Отрицательный')
(16, 2, 12, 10,'Положительный')

INSERT INTO Car_rental (rent_id, car_id, client_id, start_rent_date, end_rent_date) VALUES
(1, 8, 3, '2023-10-03', '2023-10-10')
(2, 4, 3, '2024-01-03', '2024-01-10')
(3, 2, 3, '2023-12-03', '2023-12-10')
(4, 1, 3, '2023-11-23', '2023-12-01')
(5, 7, 3, '2023-11-03', '2023-11-10')
(6, 10, 3, '2023-18-03', '2023-08-10')
(7, 15, 3, '2023-04-03', '2023-04-10')
(8, 16, 3, '2024-03-03', '2024-03-10')
(9, 17, 3, '2024-10-03', NUll)
(10, 20, 3, '2024-10-03', '2024-10-10')
(11, 22, 3, '2024-03-03', '2024-04-10')
(12, 29, 3, '2024-02-03', NULL)
(13, 25, 3, '2024-03-03', '2024-03-10')
(14, 30, 3, '2024-04-03', NULL)
(15, 6, 3, '2024-02-03', '2024-02-10')
(16 18, 3, '2024-04-03', NUll)


/*Узнаем id машин, в которых есть детское кресло*/
SELECT car_id, child_safety_seat FROM Car
WHERE child_safety_seat = 'Есть'

/*узнаем информацию о самом дорогом тарифе аренды*/
SELECT * FROM Rate
WHERE cost = (SELECT MAX(cost) FROM Rate)

/*узнаем информацию о клиентах, у которых нет прав или не оформлена ОСАГО*/
SELECT * FROM Client
WHERE driver_license_number = NULL OR CTP_policy_registration_date = NULL

/*Сортируем данные о машинах, чей рейтенг больше 5*/
SELECT * FROM Car
WHERE rating > 5
ORDER BY rating

/*Узнаем информацию о свободных машинах, сгруппировав по категориям*/
SELECT * FROM Car
WHERE status_rent = 'Свободна'
GROUP BY category

/*Узнаем информацию о действующей арендн от клиентов 15/16*/
SELECT * FROM Car_rental
WHERE client_id in (15, 16) AND end_rent_date = NULL

/*Узнаем информацию о клиентах, у которых есть все документы, сгруппировав по фамилиям)*/
SELECT client_id, sur, first_name, patronymic, birth_date FROM Client
WHERE driver_license_number <> NULL AND CTP_policy_registration_date <> NULL
GROUP BY surname
HAVING passport_series_number <> NULL

/*Узнаем информацию о тарифах, отсортированных в порядке возрастания (10 первых строк)*/
SELECT * from Rate
ORDER BY cost
LIMIT 10

/*Узнаем информацию о машине(ах) с самым высоким рейтенгом*/
SELECT * FROM Car
where MAX(rating)

/*Узнаем количесвто уникальных значений из столбца "категория" в таблице*/
SELECT COUNT(DISTINCT category) AS count_category FROM Car
